Description: Downloads latest FileMaker Pro Advanced updater disk image and extracts the package from within.
Identifier: com.github.bishopja-ninds.download.FileMakerProAdvanced

Input:
  NAME: FileMaker Pro Advanced
  MAJOR_VERSION: '18'
  STOPPROCESSINGIF_PREDICATE: download_changed == FALSE

Process:
- Processor: FilemakerProAdvancedUpdateURLProcessor
  Arguments:
    major_version: '%MAJOR_VERSION%'

- Processor: URLDownloader
  Arguments:
    url: https://fmdl.filemaker.com/esd/fmpa_%version%.dmg

- Processor: StopProcessingIf
  Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'
