Description: Signs the already downloaded and created Oracle Java package.
Identifier: com.github.bishopja-ninds.sign.oraclejava
ParentRecipe: com.github.autopkg.pkg.OracleJava8

Input:
  SIGNINGCERTIFICATE: "3rd Party Mac Developer Installer: The National Institute of Neurological Disorders and Stroke (UBAH757F69)"

Process:
  - Processor: com.github.rtrouton.SharedProcessors/PkgSigner
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      signing_cert: "%SIGNINGCERTIFICATE%"
