Description: Downloads the latest version of Microsoft Office Pro Business suite and makes a pkg. Then, uploads to the Jamf Pro Server.
Identifier: com.github.bishopja-ninds.recipes.upload.MicrosoftOfficed
MinimumVersion: "2.3"
ParentRecipe: com.github.bishopja-ninds.sign.MicrosoftOffice

Input:
  CATEGORY: Utilities

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
