Descrpition: Recipe to sign and upload ImageJ
Identifier: com.github.bishopja-ninds.upload.imagej
ParentRecipe: com.github.bishopja-ninds.download.imagej

Input:
  CATEGORY: "Statistics Software"
  SIGNINGCERTIFICATE: "3rd Party Mac Developer Installer: The National Institute of Neurological Disorders and Stroke (UBAH757F69)"


Process:
- Processor: com.github.rtrouton.SharedProcessors/PkgSigner
  Arguments:
    pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
    signing_cert: "%SIGNINGCERTIFICATE%"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: "%CATEGORY%"