Description: Downloads the latest version of KNIME and creates a package.
Identifier: com.github.bishopja-ninds.pkg.MendeleyReferenceManager
ParentRecipe: com.github.bishopja-ninds.download.MendeleyReferenceManager
MinimumVersion: "2.3"

Input:
  NAME: Mendeley Reference Manager

Process:
  - Processor: AppPkgCreator
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/MendeleyReferenceManager-%version%.pkg"
