Description: Upload the signed package to the jss
Identifier: com.github.bishopja-ninds.upload.MozillaFirefox
ParentRecipe: com.github.bishopja-ninds.sign.MozillaFirefox

Input:
  CATEGORY: "Web Browsers and Internet Utilities" 

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
