Description: Dowload receipt for Firefox ESR.  
Identifier: com.github.bishopja-ninds.download.mozillafirefox

Input:
  RELEASE: latest
  LOCALE: en-US
  NAME: Firefox

Process:
  - Processor: MozillaURLProvider
    Arguments:
      product_name: firefox-esr
      release: "%RELEASE%"
      locale: "%LOCALE%"
  
  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      comment: Use wildcard matching for the app so it will also match FirefoxDeveloperEdition.app and FirefoxNightly.app
      input_path: "%pathname%/Firefox*.app"
      requirement: anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "43AQ936H96"

