Description: Upload the signed package to the jss
Identifier: com.github.bishopja-ninds.jamfupload.mozillafirefox
ParentRecipe: com.github.bishopja-ninds.sign.mozillafirefox

Input:
  CATEGORY: Browsers

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
