Description: Unpacks and rebulids the No Machine installer to include the version number
Identifier: com.github.bishopja-ninds.sign.AdobeCreativeCloud
ParentRecipe: com.github.rtrouton.pkg.AdobeCreativeCloudInstallerUniversal

Input:
  NAME: AdobeCreativeCloud 
  SIGNINGCERTIFICATE: "3rd Party Mac Developer Installer: The National Institute of Neurological Disorders and Stroke (UBAH757F69)"

Process:
  - Processor: com.github.rtrouton.SharedProcessors/PkgSigner
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%VENDOR%%NAMEWITHOUTSPACES%-Universal-%version%.pkg"
      signing_cert: "%SIGNINGCERTIFICATE%"

