Description:  Signs GitHub Desktop installer with the NINDS certificate
Identifier: com.github.bishopja-ninds.upload.githubdesktop
ParentRecipe: com.github.homebysix.download.GitHubDesktop

Input:
  CATEGORY: Utilities
  NAME: GitHubDesktop
  SIGNINGCERTIFICATE: "3rd Party Mac Developer Installer: The National Institute of Neurological Disorders and Stroke (UBAH757F69)"

Process:
- Processor: PkgCreator
  Arguments:
    pkg_request: 
      id: com.github.githubdesktop 
      pkgname: "%NAME%-%version%"
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"
      version: "%version%" 
      options: purge_ds_store
      chown:
        - path: Applications
          user: root
          group: admin

- Processor: com.github.rtrouton.SharedProcessors/PkgSigner
  Arguments:
    pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
    signing_cert: "%SIGNINGCERTIFICATE%"


- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: "%CATEGORY%"