Description: Downloads the latest version of VLC and makes a pkg. Then, uploads to the Jamf Pro Server.
Identifier: com.github.bishopja-ninds.recipes.jamf.vlc-pkg-upload
MinimumVersion: "2.3"
ParentRecipe: com.github.bishopja-ninds.recipes.jamf.vlc.sign

Input:
  CATEGORY: Utilities

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
