Description: Uploads to the jss
Identifier: com.github.bishopja-ninds.jamf.MicrosoftOutlook
ParentRecipe: com.github.bishopja-ninds.sign.MicrosoftOutlook

Input:
  GROUP_TEMPLATE: "SmartGroupUpdate-template.xml"
  GROUP_NAME: "TestUpdateMicrosoftOutlook"
  POLICY_TEMPLATE: "Policy-template.xml"
  POLICY_NAME: "Test Update Microsoft Outlook"
  TESTING_GROUP_NAME: "TESTGROUP"
  APP_NAME: "Microsoft Outlook.app"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader 

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"
      APP_NAME: "%APP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
