Description: Downloads the latest version of Microsoft Outlook and makes a pkg. Then, uploads to the Jamf Pro Server.
Identifier: com.github.bishopja-ninds.upload.MicrosoftOutlook
MinimumVersion: "2.3"
ParentRecipe: com.github.bishopja-ninds.sign.MicrosoftOutlook

Input:
  CATEGORY: Productivity

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
