Description: Upload the signed package to the jss
Identifier: com.github.bishopja-ninds.upload.Slack
ParentRecipe: com.github.bishopja-ninds.sign.Slack

Input:
  CATEGORY: Utilities

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
