Description: Uploads to the jss
Identifier: com.github.bishopja-ninds.upload.MicrosoftWord
ParentRecipe: com.github.bishopja-ninds.sign.MicrosoftWord

Input:
  GROUP_TEMPLATE: "SmartGroupUpdate-template.xml"
  GROUP_NAME: "TestUpdateMicrosoftTeams"
  POLICY_TEMPLATE: "Policy-template.xml"
  POLICY_NAME: "Test Update Microsoft Teams"
  TESTING_GROUP_NAME: "TESTGROUP"
  APP_NAME: "Microsoft Teams.app"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader 
