Description: Downloads the latest version of Visual Studio Code and makes a pkg. Then, uploads to the Jamf Pro Server.
Identifier: com.github.bishopja-ninds.upload.MicrosoftSkype
MinimumVersion: "2.3"
ParentRecipe: com.github.bishopja-ninds.sign.MicrosoftSkype

Input:
  CATEGORY: Productivity

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
