Description: Unpacks and rebulids the No Machine installer to include the version number
Identifier: com.github.bishopja-ninds.pkg.NoMachine
ParentRecipe: com.github.bishopja-ninds.download.NoMachine

Input:
  NAME: NoMachine

Process:

  - Processor: PkgCopier
    Arguments:
      source_pkg: "%pathname%/NoMachine.pkg"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%url_version_number%.pkg"

