Description: Uploads to the jss
Identifier: com.github.bishopja-ninds.jamf.NoMachine
ParentRecipe: com.github.bishopja-ninds.sign.NoMachine

Input:
  GROUP_TEMPLATE: "SmartGroupUpdate-template.xml"
  GROUP_NAME: "TestUpdateNoMachine"
  POLICY_TEMPLATE: "Policy-template.xml"
  POLICY_NAME: "Test Update NoMachine"
  TESTING_GROUP_NAME: "TESTGROUP"
  APP_NAME: "NoMachine.app"


Process:

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader 

#  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

#  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
#    Arguments:
#      computergroup_template: "%GROUP_TEMPLATE%"
#      computergroup_name: "%GROUP_NAME%"
#      APP_NAME: "%APP_NAME%"

#  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
#    Arguments:
#      policy_template: "%POLICY_TEMPLATE%"
#      policy_name: "%POLICY_NAME%"

