Description: Uploads to the jss
Identifier: com.github.bishopja-ninds.upload.NoMachine
ParentRecipe: com.github.bishopja-ninds.sign.NoMachine

Input:
  GROUP_TEMPLATE: "SmartGroupUpdate-template.xml"
  GROUP_NAME: "TestUpdateNoMachine"
  POLICY_TEMPLATE: "Policy-template.xml"
  POLICY_NAME: "Test Update NoMachine"
  TESTING_GROUP_NAME: "TESTGROUP"
  APP_NAME: "NoMachine.app"


Process:

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader 
