Description: Unpacks and rebulids the No Machine installer to include the version number
Identifier: com.github.bishopja-ninds.sign.NoMachine
ParentRecipe: com.github.bishopja-ninds.pkg.NoMachine

Input:
  NAME: NoMachine
  SIGNINGCERTIFICATE: "3rd Party Mac Developer Installer: The National Institute of Neurological Disorders and Stroke (UBAH757F69)"

Process:
  - Processor: com.github.rtrouton.SharedProcessors/PkgSigner
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%url_version_number%.pkg"
      signing_cert: "%SIGNINGCERTIFICATE%"

