Description: Downloads the latest version of Microsoft Excel and makes a pkg. Then, uploads to the Jamf Pro Server.
Identifier: com.github.bishopja-ninds.upload.MicrosoftExcel
MinimumVersion: "2.3"
ParentRecipe: com.github.bishopja-ninds.recipes.sign.MicrosoftExcel

Input:
  CATEGORY: Utilities

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
