Description: Downloads the latest version of Microsoft Skype for Business and makes a pkg. Then, uploads to the Jamf Pro Server.
Identifier: com.github.bishopja-ninds.upload.MicrosoftSkypeforBusiness
MinimumVersion: "2.3"
ParentRecipe: com.github.bishopja-ninds.sign.MicrosoftSkypeforBusiness

Input:
  CATEGORY: Utilities

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
