Description: Uploads to the jss
Identifier: com.github.bishopja-ninds.upload.AdobeReaderDC
ParentRecipe: com.github.novaksam.pkg.AdobeAcrobatReaderDCUpdates

Input:
  APP_NAME: "AdobeReaderDC"


Process:
  - Processor: com.github.rtrouton.SharedProcessors/PkgSigner
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      signing_cert: "%SIGNINGCERTIFICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader 
