Description: Unpacks and rebulids the No Machine installer to include the version number
Identifier: com.github.bishopja-ninds.sign.AdobeReaderDC
ParentRecipe: com.github.rtrouton.pkg.AdobeReaderDC

Input:
  NAME: AdobeReaderDC 
  SIGNINGCERTIFICATE: "3rd Party Mac Developer Installer: The National Institute of Neurological Disorders and Stroke (UBAH757F69)"

Process:
  - Processor: com.github.rtrouton.SharedProcessors/PkgSigner
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      signing_cert: "%SIGNINGCERTIFICATE%"

