Description: Uploads to the jss
Identifier: com.github.bishopja-ninds.upload.MicrosoftOneDrive
ParentRecipe: com.github.bishopja-ninds.sign.MicrosoftOneDrive

Input:
  GROUP_TEMPLATE: "SmartGroupUpdate-template.xml"
  GROUP_NAME: "TestUpdateMicrosoftOneDrive"
  POLICY_TEMPLATE: "Policy-template.xml"
  POLICY_NAME: "Test Update Microsoft One Drive"
  TESTING_GROUP_NAME: "TESTGROUP"
  APP_NAME: "One Drive.app"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader 
