Description: Downloads the latest version of Google Chrome and makes a pkg. Then, uploads to the Jamf Pro Server.
Identifier: com.github.bishopja-ninds.jamf.GoogleChrome
MinimumVersion: "2.3"
ParentRecipe: com.github.bishopja-ninds.sign.GoogleChrome

Input:
  GROUP_TEMPLATE: "SmartGroupUpdate-template.xml"
  GROUP_NAME: "TestUpdateGoogleChrome"
  POLICY_TEMPLATE: "Policy-template.xml"
  POLICY_NAME: "Test Update Google Chrome"
  TESTING_GROUP_NAME: "TESTGROUP"
  APP_NAME: "Google Chrome.app"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"
      APP_NAME: "%APP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLCIY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"

