Description: Signs the already downloaded and created Googe Chrome package.
Identifier: com.github.bishopja-ninds.recipes.sign.GoogleChrome
ParentRecipe: com.github.rtrouton.pkg.googlechrome

Input:
  SIGNINGCERTIFICATE: "3rd Party Mac Developer Installer&#58; The National Institute of Neurological Disorders and Stroke &#40;UBAH757F69&#41;"

Process:
  - Processor: com.github.rtrouton.SharedProcessors/PkgSigner
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      signing_cert: "%SIGNINGCERTIFICATE%"
