Description: Signs the already downloaded and created Googe Chrome package.
Identifier: com.github.bishopja-ninds.sign.GoogleChrome
ParentRecipe: com.github.rtrouton.pkg.googlechrome

Input:
  SIGNINGCERTIFICATE: "3rd Party Mac Developer Installer: The National Institute of Neurological Disorders and Stroke (UBAH757F69)"

Process:
  - Processor: com.github.rtrouton.SharedProcessors/PkgSigner
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%pkg_name%"
      signing_cert: "%SIGNINGCERTIFICATE%"
