Description: Downloads the latest version of Dropbox and makes a pkg. Then, uploads to the Jamf Pro Server.
Identifier: com.github.bishopja-ninds.upload.Dropbox
MinimumVersion: "2.3"
ParentRecipe: com.github.bishopja-ninds.sign.Dropbox

Input:
  CATEGORY: Utilities

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
