Description: Downloads the latest version of Dropbox and makes a pkg. Then, uploads to the Jamf Pro Server.
Identifier: com.github.bishopja-ninds.recipes.jamf.Dropbox-pkg-upload
MinimumVersion: "2.3"
ParentRecipe: com.github.autopkg.pkg.dropbox

Input:
  CATEGORY: Utilities

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
