Description:  Signs the Zoom file with the NINDS certificate
Identifier: com.github.bishopja-ninds.sign.NessusAgent
ParentRecipe: com.github.bishopja-ninds.pkg.NessusAgent

Input:
  SIGNINGCERTIFICATE: "3rd Party Mac Developer Installer: The National Institute of Neurological Disorders and Stroke (UBAH757F69)"

Process:
  - Processor: com.github.rtrouton.SharedProcessors/PkgSigner
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      signing_cert: "%SIGNINGCERTIFICATE%"
