Description: Downloads the latest version of Microsoft OneNote and makes a pkg. Then, uploads to the Jamf Pro Server.
Identifier: com.github.bishopja-ninds.recipes.jamf.MicrosoftOneNote-pkg-upload
MinimumVersion: "2.3"
ParentRecipe: com.github.bishopja-ninds.recipes.sign.MicrosoftOneNote

Input:
  CATEGORY: Utilities

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
