Description: Uploads to the jss
Identifier: com.github.bishopja-ninds.upload.parallelsdesktop

Input:
  MAJOR_VERSION: '18'
  MINOR_VERSION: '1.0'
  DL_NAME: "Parallels Desktop"
  NAME: "ParallelsDesktop"
  SERIAL: "6J9CSE-NM4STY-XQQ6BW-GRQX9H-VJA77G"
  PLATFORM_ARCH: "image"

Process:
- Processor: URLDownloader
  Arguments:
    url: "https://www.parallels.com/directdownload/pd%MAJOR_VERSION%/%PLATFORM_ARCH%"
    filename: "%DL_NAME%-%MAJOR_VERSION%.dmg"

- Processor: EndOfCheckPhase

#- Processor: CodeSignatureVerifier
#  Arguments:
#    input_path: "%pathname%/Parallels Desktop.app"
#    requirement: "anchor apple generic and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4C6364ACXT")"

- Processor: Versioner
  Arguments:
    input_plist_path: "%pathname%/Install.app/Contents/Info.plist"
    plist_version_key: CFBundleShortVersionString

- Processor: Copier
  Arguments:
    source_path: "%pathname%"
    destination_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg" 

- Processor: URLDownloader
  Arguments:
    url: "https://download.parallels.com/desktop/tools/pd-autodeploy.zip"
  
- Processor: Unarchiver
  Arguments:
    archive_path: "%pathname%"
    destination_path: "%RECIPE_CACHE_DIR%/unarchive/"
    purge_destination: true

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      tmp: '775'
      tmp/parallels: '775'
    pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: "%RECIPE_CACHE_DIR%/Scripts"

- Processor: Copier
  Arguments:
    source_path: "%RECIPE_CACHE_DIR%/unarchive/Parallels Desktop Business Edition mass deployment package*/Parallels Desktop Autodeploy.pkg"
    destination_path: "%pkgroot%/tmp/parallels"

- Processor: Copier
  Arguments:
    source_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg"
    destination_path: "%pkgroot%/tmp/paralles/Parallels Desktop Autodeploy.pkg/Parallels Desktop DMG/"

- Processor: PathDeleter
  Arguments:
    path_list:
    - "%pkgroot%/tmp/parallels/Parallels Desktop Autodeploy.pkg/License Key and Configuration/deploy.cfg"
    
- Processor: FileCreator
  Arguments:
    file_content: |
      license_key="%SERIAL%"
      vm_register_mode="Private"
      vm_reset_hwid="no"
      vm_deploy_mode="Copy"
      vm_set_hv_mode_apple_forcibly_since_macos_11_0="yes"
      cep_participation="off"
      show_developers_menu="no"
    file_mode: '660'
    file_path: "%pkgroot%/tmp/parallels/Parallels Desktop Autodeploy.pkg/License Key and Configuration/deploy.cfg"
  
- Processor: FileCreator
  Arguments: 
    file_content: |
      sudo launchctl stop com.parallels.desktop.launchdaemon
      /usr/sbin/installer -pkg "/private/tmp/parallels/Parallels Desktop Autodeploy.pkg" -target /
      rm -rf /private/tmp/parallels
    file_mode: '0755'
    file_path: "%RECIPE_CACHE_DIR%/Scripts/postinstall"

- Processor: PkgCreator
  Arguments:
    force_pkg_build: true
    pkg_request:
      id: com.parallels.parallelsinstall
      options: purge_ds_store
      pkgname: "%NAME%-%version%"
      pkgroot: pkgroot
      scripts: Scripts    

- Processor: PathDeleter
  Arguments:
    path_list:
      - "%RECIPE_CACHE_DIR%/pkgroot"
      - "%RECIPE_CACHE_DIR%/Scripts"
      - "%RECIPE_CACHE_DIR%/downloads"
