Description:  Signs the Cylance file with the NINDS certificate
Identifier: com.github.bishopja-ninds.upload.cylance

Input:
  VENDOR: "Cylance"
  VERSION: "3.1.1000"
  DOWNLOADS: "/Users/bishopja/Downloads/"
  PKG: "%DOWNLOADS%CylancePROTECT.pkg"
  CATEGORY: "SecurityAgents"
  SIGNINGCERTIFICATE: "3rd Party Mac Developer Installer: The National Institute of Neurological Disorders and Stroke (UBAH757F69)"

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      tmp: '775'
      tmp/cylance: '775'
    pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: "%RECIPE_CACHE_DIR%/Scripts"

- Processor: Copier
  Arguments:
    source_path: "%PKG%"
    destination_path: "%RECIPE_CACHE_DIR%/pkgroot/tmp/cylance/CylancePROTECT.pkg"

- Processor: FileCreator
  Arguments:
    file_content: |
      oZS0HOKejU7KICGERk6m0h6UG
      NoCylanceUI
      SelfProtectionLevel=2
      VenueZone=NINDS_Pre
      LogLevel=2
    file_mode: "0755"
    file_path: "%RECIPE_CACHE_DIR%/pkgroot/tmp/cylance/cyagent_install_token"

- Processor: FileCreator
  Arguments:
    file_content: |
      #!/bin/bash
      /usr/sbin/installer -pkg /private/tmp/cylance/CylancePROTECT.pkg -target /
      rm -rf /private/tmp/cylance
    file_mode: "0755"
    file_path: "%RECIPE_CACHE_DIR%/Scripts/postinstall"

- Processor: PkgCreator
  Arguments:
    version: "%VERSION%"
    force_pkg_build: true
    pkg_request:
      id: com.cylance.%VERSION%
      options: purge_ds_store
      pkgname: "%VENDOR%-%VERSION%"
      pkgroot: pkgroot
      scripts: Scripts


- Processor: PathDeleter
  Arguments:
    path_list:
     - "%RECIPE_CACHE_DIR%/pkgroot"
     - "%PKG%"
     - "%RECIPE_CACHE_DIR%/Scripts"

- Processor: com.github.rtrouton.SharedProcessors/PkgSigner
  Arguments:
    pkg_path: "%pkg_path%"
    signing_cert: "%SIGNINGCERTIFICATE%"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader 
  Arguments:
    pkg_category: "%CATEGORY%"