Description: Downloads the latest version of Visual Studio Code and makes a pkg. Then, uploads to the Jamf Pro Server.
Identifier: com.github.bishopja-ninds.sign.MicrosoftVisualStudioCode
MinimumVersion: "2.3"
ParentRecipe: com.github.killahquam.pkg.visualstudiocode

Input:
  SIGNINGCERTIFICATE: "3rd Party Mac Developer Installer: The National Institute of Neurological Disorders and Stroke (UBAH757F69)"

Process:
  - Processor: com.github.rtrouton.SharedProcessors/PkgSigner
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%url_version_number%.pkg"
      signing_cert: "%SIGNINGCERTIFICATE%"
